koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM322.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>Timer2</name>
      <description>General purpose timer 2</description>
      <groupName>Timer</groupName>
      <baseAddress>0x40000800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TIMER2</name>
        <value>48</value>
      </interrupt>
      <registers>
        <register>
          <name>T2LD</name>
          <description>16-bit load value register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LOAD</name>
              <description>Load value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000FFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>T2VAL</name>
          <description>16-bit timer value register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x00000010</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>VAL</name>
              <description>Current count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000FFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>T2CON</name>
          <description>Control register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x0000000A</resetValue>
          <fields>
            <field>
              <name>EVENTEN</name>
              <description>Event select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Events will not be captured</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Events will be captured</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVENT</name>
              <description>Event select range</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000000F</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>RLD</name>
              <description>Reload control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Resets the up/down counter when TCLRI[0]
                    is set</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Up/Down counter is only reset on a
                    timeout event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLK</name>
              <description>Clock select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCLK</name>
                  <description>PCLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HCLK</name>
                  <description>HCLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFOSC</name>
                  <description>32 KHz OSC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXTAL</name>
                  <description>16 MHz OSC or XTAL (Dependent on
                    CLKCON0.11)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Timer enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Timer is disabled (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Timer is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MOD</name>
              <description>Timer mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FREERUN</name>
                  <description>Timer runs in free running mode
                  </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERIODIC</name>
                  <description>Timer runs in periodic mode (default)
                  </description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UP</name>
              <description>Count up</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Timer is set to count down (default)
                  </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Timer is set to count up</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRE</name>
              <description>Prescaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>source_clock / [1 or 4]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>source_clock / 16</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV256</name>
                  <description>source_clock / 256</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32768</name>
                  <description>source_clock / 32,768</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>T2CLRI</name>
          <description>Clear interrupt register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>0x00000010</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CAP</name>
              <description>Clear captured event interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>Clear the capture event interrupt
                  </description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMOUT</name>
              <description>Clear timeout interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>Clears the timeout interrupt
                  </description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>T2CAP</name>
          <description>Capture register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>0x00000010</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CAP</name>
              <description>16-bit captured value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000FFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>T2STA</name>
          <description>Status register</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>0x00000010</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PDOK</name>
              <description>TCLRI synchronization</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>The interrupt is cleared in the timer
                    clock domain</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>TCLRI[0] is being updated in the timer
                    clock domain</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUSY</name>
              <description>Timer Busy</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>Timer ready to receive commands to TCON
                  </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Timer not ready to receive commands to
                    TCON</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP</name>
              <description>Capture event pending</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>No capture event is pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>A capture event is pending</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMOUT</name>
              <description>Timeout event occurred</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>No timeout event has occurred
                  </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>A timeout event has occurred
                  </description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
