koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM322.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WUT</name>
      <description>Wake up Timer</description>
      <groupName>Timer</groupName>
      <baseAddress>0x40002500</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x44</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WUT</name>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>T4VAL0</name>
          <description>Current count value - LS 16 bits</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x00000010</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>T4VALL</name>
              <description>Current count Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000FFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>T4VAL1</name>
          <description>Current count value - MS 16 bits</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x00000010</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>T4VALH</name>
              <description>Current count high</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000FFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>T4CON</name>
          <description>Control register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>STOP_WUFA</name>
              <description>Disables updating field A register T4WUFA
              </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CLK</name>
              <description>Clock select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCLK</name>
                  <description>: PCLK (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFOSC</name>
                  <description>: 32 kHz internal oscillator
                  </description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ECLKIN</name>
                  <description>: External clock from P1.0</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WUEN</name>
              <description>Wakeup enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>: Cleared by user to disable the wake up
                    timer when the core clock is off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>: Set by user to enable the wake up timer
                    even when the core clock is off.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Timer enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>: Disable the timer (default).
                  </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>: Enable the timer.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MOD</name>
              <description>Timer mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PERIODIC</name>
                  <description>: Cleared by user to operate in periodic
                    mode. In this mode, the timer counts up to T4WUFD
                  </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREERUN</name>
                  <description>: Set by user to operate in free running
                    mode (default).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FREEZE</name>
              <description>Freeze enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>: Cleared by user to disable this feature
                    (default).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>: Set by user to enable the freeze of the
                    high 16-bits after the lower bits have been read
                    from T4VAL0. This ensures that the software will
                    read an atomic shot of the timer. T4VAL1 unfreezes
                    after it has been read.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRE</name>
              <description>Prescaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PREDIV1</name>
                  <description>: source clock/1 (default). If the
                    selected clock source is PCLK, then this setting
                    results in a prescaler of 4.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PREDIV16</name>
                  <description>: source clock/16</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PREDIV256</name>
                  <description>: source clock/256</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PREDIV32768</name>
                  <description>: source clock/32,768</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>T4INC</name>
          <description>12-bit interval for wakeup field A</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x000000C8</resetValue>
          <fields>
            <field>
              <name>INTERVAL</name>
              <description>Interval for wakeup field A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000FFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>T4WUFB0</name>
          <description>Wakeup field B - LS 16 bits</description>
          <addressOffset>0x00000010</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00001FFF</resetValue>
          <fields>
            <field>
              <name>T4WUFBL</name>
              <description>Wakeup field B low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000FFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>T4WUFB1</name>
          <description>Wakeup field B - MS 16 bits</description>
          <addressOffset>0x00000014</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>T4WUFBH</name>
              <description>Wakeup field B High</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000FFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>T4WUFC0</name>
          <description>Wakeup field C - LS 16 bits</description>
          <addressOffset>0x00000018</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00002FFF</resetValue>
          <fields>
            <field>
              <name>T4WUFCL</name>
              <description>Wakeup field C Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000FFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>T4WUFC1</name>
          <description>Wakeup field C - MS 16 bits</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>T4WUFCH</name>
              <description>Wakeup field C High</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000FFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>T4WUFD0</name>
          <description>Wakeup field D - LS 16 bits</description>
          <addressOffset>0x00000020</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00003FFF</resetValue>
          <fields>
            <field>
              <name>T4WUFD0</name>
              <description>Wakeup field D Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000FFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>T4WUFD1</name>
          <description>Wakeup field D - MS 16 bits</description>
          <addressOffset>0x00000024</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>T4WUFDH</name>
              <description>Wakeup field D high</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000FFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>T4IEN</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x00000028</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ROLL</name>
              <description>Rollover interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WUFD</name>
              <description>T4WUFD interrupt enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WUFC</name>
              <description>T4WUFC interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WUFB</name>
              <description>T4WUFB interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WUFA</name>
              <description>T4WUFA interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>T4STA</name>
          <description>Status register</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>0x00000010</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PDOK</name>
              <description>Enable bit synchronized</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FREEZE</name>
              <description>Timer value freeze</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>IRQCRY</name>
              <description>Wakeup status to powerdown</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>ROLL</name>
              <description>Rollover interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WUFD</name>
              <description>T4WUFD interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WUFC</name>
              <description>T4WUFC interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WUFB</name>
              <description>T4WUFB interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WUFA</name>
              <description>T4WUFA interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>T4CLRI</name>
          <description>Clear interrupt register</description>
          <addressOffset>0x00000030</addressOffset>
          <size>0x00000010</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ROLL</name>
              <description>Rollover interrupt clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WUFD</name>
              <description>T4WUFD interrupt clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WUFC</name>
              <description>T4WUFC interrupt clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WUFB</name>
              <description>T4WUFB interrupt clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>WUFA</name>
              <description>T4WUFA interrupt clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
