koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM322.svd
        <register>
          <name>PLA_IRQ1</name>
          <description>Interrupt Register for Block 2 and 3
          </description>
          <addressOffset>0x00000088</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>irq3_en</name>
              <description>IRQ3 enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>disable IRQ3 interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>enable IRQ3 interrupt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>irq3_src</name>
              <description>IRQ3 source select (Elements 16-31) Element
                number corresponds to 4-bit value + 16 (e.g. 1011
                selects Element 27).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000000F</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>irq2_en</name>
              <description>IRQ2 enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>disable IRQ2 interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>enable IRQ2 interrupt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>irq2_src</name>
              <description>IRQ2 source select (Elements 16-31). Element
                number corresponds to 4-bit value + 16 (e.g. 1011
                selects Element 27).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000000F</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PLA_ADC</name>
          <description>ADC Configuration Register</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>convst_en</name>
              <description>Bit to enable ADC start convert from PLA
              </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>convst_src</name>
              <description>Element for ADC start convert source. The
                binary value corresponds to the element number. For
                example Element 23 is 10111</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000001F</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PLA_DIN0</name>
          <description>AMBA Bus Data Input for Block 0 and 1
          </description>
          <addressOffset>0x00000090</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DIN</name>
              <description>TBD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000FFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PLA_DOUT0</name>
          <description>AMBA Bus Data Output for Block 0 and 1
          </description>
          <addressOffset>0x00000098</addressOffset>
          <size>0x00000010</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>E15</name>
              <description>Output bit from Element 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E14</name>
              <description>Output bit from Element 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E13</name>
              <description>Output bit from Element 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E12</name>
              <description>Output bit from Element 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E11</name>
              <description>Output bit from Element 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E10</name>
              <description>Output bit from Element 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E9</name>
              <description>Output bit from Element 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E8</name>
              <description>Output bit from Element 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E7</name>
              <description>Output bit from Element 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E6</name>
              <description>Output bit from Element 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E5</name>
              <description>Output bit from Element 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E4</name>
              <description>Output bit from Element 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E3</name>
              <description>Output bit from Element 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E2</name>
              <description>Output bit from Element 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E1</name>
              <description>Output bit from Element 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E0</name>
              <description>Output bit from Element 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PLA_DOUT1</name>
          <description>AMBA Bus Data Output for Block 2 and 3
          </description>
          <addressOffset>0x0000009C</addressOffset>
          <size>0x00000010</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>E31</name>
              <description>Output bit from Element 31</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E30</name>
              <description>Output bit from Element 30</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E29</name>
              <description>Output bit from Element 29</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E28</name>
              <description>Output bit from Element 28</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E27</name>
              <description>Output bit from Element 27</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E26</name>
              <description>Output bit from Element 26</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E25</name>
              <description>Output bit from Element 25</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E24</name>
              <description>Output bit from Element 24</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E23</name>
              <description>Output bit from Element 23</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E22</name>
              <description>Output bit from Element 22</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E21</name>
              <description>Output bit from Element 21</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E20</name>
              <description>Output bit from Element 20</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E19</name>
              <description>Output bit from Element 19</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E18</name>
              <description>Output bit from Element 18</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E17</name>
              <description>Output bit from Element 17</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>E16</name>
              <description>Output bit from Element 16</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>PLA_LCK</name>
          <description>Write lock Register. Can only be set once every
            reset</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Set to disable writing to registers
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Writing to registers allowed
                  </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Writing to registers disabled
                  </description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
