koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM322.svd
        <register>
          <name>PLA_PROBE_I2C</name>
          <description>PLA GPIO INPUT can be switched to probe I2C
            SCL/SDA</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ELEM3</name>
              <description>Connects either GPIO or I2C as the GPIO input
                to BLOCK 0 element 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P0_3</name>
                  <description>PLA PROBE GPIO P0.3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_SDA</name>
                  <description>PLA PROBE I2C1_SDA</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ELEM2</name>
              <description>Connects either GPIO or I2C as the GPIO input
                to BLOCK 0 element 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P0_2</name>
                  <description>PLA PROBE GPIO P0.2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C1_SCL</name>
                  <description>PLA PROBE I2C1_SCL</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ELEM1</name>
              <description>Connects either GPIO or I2C as the GPIO input
                to BLOCK 0 element 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P0_1</name>
                  <description>PLA PROBE GPIO P0.1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_SDA</name>
                  <description>PLA PROBE I2C0_SDA</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ELEM0</name>
              <description>Connects either GPIO or I2C as the GPIO input
                to BLOCK 0 element 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P0_0</name>
                  <description>PLA PROBE GPIO P0.0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C0_SCL</name>
                  <description>PLA PROBE I2C0_SCL</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>Direct Memory Access</description>
      <groupName>DMA</groupName>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFE4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA_ERR</name>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>DMA_SPI0_TX</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>DMA_SPI0_RX</name>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>DMA_SPI1_TX</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>DMA_SPI1_RX</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>DMA_UART_TX</name>
        <value>30</value>
      </interrupt>
      <interrupt>
        <name>DMA_UART_RX</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>DMA_I2C0S_TX</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>DMA_I2C0S_RX</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>DMA_I2C0M</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>DMA_I2C1S_TX</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>DMA_I2C1S_RX</name>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>DMA_I2C1M</name>
        <value>37</value>
      </interrupt>
      <interrupt>
        <name>DMA_ADC</name>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>DMA_FLASH</name>
        <value>39</value>
      </interrupt>
      <registers>
        <register>
          <name>DMASTA</name>
          <description>DMA Status</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x00000020</size>
          <access>read-only</access>
          <resetValue>0x000F0000</resetValue>
          <fields>
            <field>
              <name>CHNLSM1</name>
              <description>Number of available DMA channels minus 1
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000001F</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>STATE</name>
              <description>Current state of DMA controller</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000000F</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>MENABLE</name>
              <description>Enable status of the controller</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACFG</name>
          <description>DMA Configuration</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x00000020</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MENABLE</name>
              <description>Controller enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAPDBPTR</name>
          <description>DMA channel primary control data base pointer
          </description>
          <addressOffset>0x00000008</addressOffset>
          <size>0x00000020</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CTRLBASEPTR</name>
              <description>Pointer to the base address of the primary
                data structure</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0xFFFFFFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAADBPTR</name>
          <description>DMA channel alternate control data base pointer
          </description>
          <addressOffset>0x0000000C</addressOffset>
          <size>0x00000020</size>
          <access>read-only</access>
          <resetValue>0x00000100</resetValue>
          <fields>
            <field>
              <name>ALTCBPTR</name>
              <description>Base address of the alternate data structure
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0xFFFFFFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASWREQ</name>
          <description>DMA channel software request</description>
          <addressOffset>0x00000014</addressOffset>
          <size>0x00000020</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHSWREQ</name>
              <description>Generate software request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00003FFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARMSKSET</name>
          <description>DMA channel request mask set</description>
          <addressOffset>0x00000020</addressOffset>
          <size>0x00000020</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHREQMSET</name>
              <description>Mask requests from DMA channels</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00003FFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMARMSKCLR</name>
          <description>DMA channel request mask clear</description>
          <addressOffset>0x00000024</addressOffset>
          <size>0x00000020</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHREQMCLR</name>
              <description>Clear REQ_MASK_SET bits in DMARMSKSET
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00003FFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAENSET</name>
          <description>DMA channel enable set</description>
          <addressOffset>0x00000028</addressOffset>
          <size>0x00000020</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHENSET</name>
              <description>Enable DMA channels</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00003FFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAENCLR</name>
          <description>DMA channel enable clear</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>0x00000020</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHENCLR</name>
              <description>Disable DMA channels</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00003FFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAALTSET</name>
          <description>DMA channel primary-alternate set</description>
          <addressOffset>0x00000030</addressOffset>
          <size>0x00000020</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHPRIALTSET</name>
              <description>Control struct status / select alt struct
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00003FFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAALTCLR</name>
          <description>DMA channel primary-alternate clear</description>
          <addressOffset>0x00000034</addressOffset>
          <size>0x00000020</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHPRIALTCLR</name>
              <description>Select primary data struct</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00003FFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAPRISET</name>
          <description>DMA channel priority set</description>
          <addressOffset>0x00000038</addressOffset>
          <size>0x00000020</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHPRISET</name>
              <description>Configure channel for high priority
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00003FFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAPRICLR</name>
          <description>DMA channel priority clear</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>0x00000020</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHPRICLR</name>
              <description>Configure channel for default priority level
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00003FFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAERRCLR</name>
          <description>DMA Per Channel Bus Error</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>0x00000020</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ERRCLR</name>
              <description>Bus error status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00003FFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMABSSET</name>
          <description>DMA channel bytes swap enable set</description>
          <addressOffset>0x00000800</addressOffset>
          <size>0x00000020</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHBSWAPSET</name>
              <description>Byte swap status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00003FFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>DMABSCLR</name>
          <description>DMA channel bytes swap enable clear</description>
          <addressOffset>0x00000804</addressOffset>
          <size>0x00000020</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CHBSWAPCLR</name>
              <description>Disable byte swap</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00003FFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
