koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM322.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FEE</name>
      <description>Flash Controller</description>
      <groupName>FEE</groupName>
      <baseAddress>0x40018000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE8</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLASH</name>
        <value>17</value>
      </interrupt>
      <registers>
        <register>
          <name>FEESTA</name>
          <description>Status register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>0x00000020</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <readAction>modify</readAction>
          <fields>
            <field>
              <name>INIT</name>
              <description>Initialization upload in progress.
              </description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SIGNERR</name>
              <description>Information space signature check on reset
                error.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CMDRES</name>
              <description>These two bits indicate the status of a
                command on completion or the status of a write.
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SUCCESS</name>
                  <description>Successful completion of a command or a
                    write</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IGNORED</name>
                  <description>Attempted signcheck, write or erase of a
                    protected location.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READERROR</name>
                  <description>Read verify error. After an erase the
                    controller reads the corresponding word(s) to verify
                    that the transaction completed successfully. If data
                    read is not all 'F's this is the resulting status.If
                    the Sign command is executed and the resulting
                    signature does not match the data in the upper 4
                    bytes of the upper page in a block then this is the
                    resulting status.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABORTED</name>
                  <description>Indicates that a command or a write was
                    aborted by an abort command or a system interrupt
                    has caused an abort</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRALMOSTDONE</name>
              <description>Write almost Complete - key-hole registers
                open for access. This bit flags the earliest point at
                which the flash controller data and address may be
                updated for the next command without affecting an active
                flash command operation.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>Cleared to 0 when read</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set to 1 when a write completes
                  </description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDDONE</name>
              <description>This bit asserts when a command completes.
              </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>Cleared to 0 when read</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set to 1 when a command completes
                  </description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WRCLOSE</name>
              <description>This bit is asserted when the user has
                written all key-hole registers for flash write and the
                controller has started the write.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>CMDBUSY</name>
              <description>Command busy.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FEECON0</name>
          <description>Command Control register: interrupt enable
            register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>0x00000020</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IENERR</name>
              <description>Command fail interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IWRALCOMP</name>
              <description>Write almost complete interrupt enable
              </description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IENCMD</name>
              <description>Command complete interrupt enable
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FEECMD</name>
          <description>Command register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>0x00000020</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMD</name>
              <description>Commands</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>No command executed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PAGEERASE</name>
                  <description>Write the address of the page to be
                    erased to the FEEADR0 register, then write this code
                    to the FEECMD and the flash will erase the page.
                    When the erase has completed the flash will read
                    every location in the page to verify all words in
                    the page are erased. If there is a read verify error
                    this will be indicated in the Status register. To
                    erase multiple pages wait until a previous page
                    erase has completed - check the status then issue a
                    command to start the next page erase. Before
                    entering this command 0xF123F456 must first be
                    written to the FEEKEY register.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIGN</name>
                  <description>Use this command to generate a signature
                    for a block of data. The signature is generated on a
                    page by page basis. To generate a signature the
                    address of the first page of the block is entered in
                    the FEEADR0 register, the address of the last page
                    is written to the FEEADR1 register, then write this
                    code to the FEECMD register. When the command has
                    completed the signature is available for reading in
                    the Sign register. The last 4 bytes of the last page
                    in a block is reserved for storing the signature.
                    Before entering this command 0xF123F456 must first
                    be written to the FEEKEY register.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>Use this command to write to flash
                    locations. This command needs a UserKey for writing
                    into write protection location and userfaakey
                    location. No key is required for other flash
                    locations. This command takes the address, data from
                    FEEADR, FEEFLDATA key-hole registers.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASSERASE0</name>
                  <description>Erase all of flash0 user space. To enable
                    this operation 0xF123F456 must first be written to
                    the FEEKEY register (this is to prevent accidental
                    erases). When the mass erase has completed the
                    controller will read every location to verify that
                    all locations are 0xFFFFFFFFFFFFFFFF. If there is a
                    read verify error this will be indicated in the
                    Status register.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASSERASE1</name>
                  <description>Erase all of flash1 user space. To enable
                    this operation 0xF123F456 must first be written to
                    the FEEKEY register (this is to prevent accidental
                    erases). When the mass erase has completed the
                    controller will read every location to verify that
                    all locations are 0xFFFFFFFFFFFFFFFF. If there is a
                    read verify error this will be indicated in the
                    Status register.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABORT</name>
                  <description>If this command is issued then any
                    command currently in progress will be stopped. The
                    status will indicate command completed with an error
                    status (FEESTA[5:4] = 0x3). Note that this is the
                    only command that can be issued while another
                    command is already in progress. This command can
                    also be used to stop a write that may be in
                    progress. If a write or erase is aborted then the
                    flash timing will be violated and it is not possible
                    to determine if the write or erase completed
                    successfully. To enable this operation 0xF123F456
                    must first be written to the FEEKEY register (this
                    is to prevent accidental aborts).</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FEEFLADR</name>
          <description>Flash address key - hole register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>0x00000020</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FLAddr</name>
              <description>Memory mapped address for the flash location
              </description>
              <bitOffset>3</bitOffset>
              <bitWidth>16</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x0000FFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FEEFLDATA0</name>
          <description>Flash Data register: key-hole interface lower 32
            bits</description>
          <addressOffset>0x00000010</addressOffset>
          <size>0x00000020</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FLDATA0</name>
              <description>FLDATA0 forms the lower 32 bit of 64 bit data
                to be written to flash</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0xFFFFFFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FEEFLDATA1</name>
          <description>Flash Data register: key-hole interface upper 32
            bits</description>
          <addressOffset>0x00000014</addressOffset>
          <size>0x00000020</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FLDATA1</name>
              <description>FLDATA1 forms the upper 32 bit of 64 bit data
                to be written to flash</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0xFFFFFFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FEEADR0</name>
          <description>Lower page address register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>0x00000020</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PageAddr0</name>
              <description>Used by SIGN and PAGEERASE commands for
                specifying page address. See the description of these
                commands in FEECMD</description>
              <bitOffset>11</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x000000FF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FEEADR1</name>
          <description>Upper page address register</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>0x00000020</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PageAddr1</name>
              <description>Used by SIGN command for specifying the end
                page address. See description of this command in FEECMD
              </description>
              <bitOffset>11</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x000000FF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FEEKEY</name>
          <description>Flash Key register.</description>
          <addressOffset>0x00000020</addressOffset>
          <size>0x00000020</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>KEY</name>
              <description>Enter 0xF123F456 to allow key protected
                operations. Returns 0x0 if read.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0xFFFFFFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FEEPRO0</name>
          <description>write protection register for flash0
          </description>
          <addressOffset>0x00000028</addressOffset>
          <size>0x00000020</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>WrProt0</name>
              <description>Write protection for flash0 - 32 bits.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0xFFFFFFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FEEPRO1</name>
          <description>write protection register for flash1
          </description>
          <addressOffset>0x0000002C</addressOffset>
          <size>0x00000020</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>WrProt1</name>
              <description>Write protection for flash1 - 32 bits.
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0xFFFFFFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>FEESIG</name>
          <description>Flash Signature</description>
          <addressOffset>0x00000034</addressOffset>
          <size>0x00000020</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SIGN</name>
              <description>24 bit signature.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00FFFFFF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
