koshkin-sergey/mbOS/Device/ADI/ADuCM32x/SVD/ADuCM322.svd
        <register>
          <name>SPI0CON</name>
          <description>SPI configuration register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MOD</name>
              <description>SPI IRQ mode bits</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TX1RX1</name>
                  <description>Tx interrupt occurs when 1 byte has been
                    transferred. Rx interrupt occurs when 1 or more
                    bytes have been received into the FIFO.
                  </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX2RX2</name>
                  <description>Tx interrupt occurs when 2 bytes has been
                    transferred. Rx interrupt occurs when 2 or more
                    bytes have been received into the FIFO.
                  </description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX3RX3</name>
                  <description>Tx interrupt occurs when 3 bytes has been
                    transferred. Rx interrupt occurs when 3 or more
                    bytes have been received into the FIFO.
                  </description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX4RX4</name>
                  <description>Tx interrupt occurs when 4 bytes has been
                    transferred. Rx interrupt occurs when the Rx FIFO is
                    full, or 4 bytes present.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TFLUSH</name>
              <description>SPI Tx FIFO Flush enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Clear this bit to disable Tx FIFO
                    flushing.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Set this bit to flush the Tx FIFO. This
                    bit does not clear itself and should be toggled if a
                    single flush is required. If this bit is left high,
                    then either the last transmitted value or "0x00" is
                    transmitted depending on the ZEN bit. Any writes to
                    the Tx FIFO are ignored while this bit is set.
                  </description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RFLUSH</name>
              <description>SPI Rx FIFO Flush enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Clear this bit to disable Rx FIFO
                    flushing.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Set this bit to flush the Rx FIFO. This
                    bit does not clear itself and should be toggled if a
                    single flush is required. If this bit is set all
                    incoming data is ignored and no interrupts are
                    generated. If set and TIM = 0, a read of the Rx FIFO
                    will initiate a transfer.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CON</name>
              <description>Continuous transfer enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Cleared by user to disable continuous
                    transfer. Each transfer consists of a single 8-bit
                    serial transfer. If valid data exists in the SPI0TX
                    register, then a new transfer is initiated after a
                    stall period of 1 serial clock cycle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Set by user to enable continuous
                    transfer. In master mode, the transfer continues
                    until no valid data is available in the Tx register.
                    CS is asserted and remains asserted for the duration
                    of each 8-bit serial transfer until Tx is empty.
                  </description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOOPBACK</name>
              <description>Loopback enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Cleared by user to be in normal mode.
                  </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Set by user to connect MISO to MOSI and
                    test software.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OEN</name>
              <description>Slave MISO output enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Clear this bit to disable the output
                    driver on the MISO pin. The MISO pin will be
                    Open-Circuit when this bit is clear.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Set this bit for MISO to operate as
                    normal.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXOF</name>
              <description>SPIRX overflow overwrite enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Cleared by user, the new serial byte
                    received is discarded.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Set by user, the valid data in the Rx
                    register is overwritten by the new serial byte
                    received.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZEN</name>
              <description>Transmit zeros enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Clear this bit to transmit the last
                    transmitted value when there is no valid data in the
                    Tx FIFO.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Set this bit to transmit "0x00" when
                    there is no valid data in the Tx FIFO.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TIM</name>
              <description>SPI transfer and interrupt mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXRD</name>
                  <description>Cleared by user to initiate transfer with
                    a read of the SPI0RX register. Interrupt only occurs
                    when Rx is full.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXWR</name>
                  <description>Set by user to initiate transfer with a
                    write to the SPI0TX register. Interrupt only occurs
                    when Tx is empty.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LSB</name>
              <description>LSB first transfer enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>MSB transmitted first</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>LSB transmitted first</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WOM</name>
              <description>SPI Wired Or mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enables open circuit data output enable.
                    External pull-ups required on data out pins
                  </description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Normal output levels</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPOL</name>
              <description>Serial Clock Polarity</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Serial clock idles low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Serial clock idles high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPHA</name>
              <description>Serial clock phase mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAMPLETRAILING</name>
                  <description>Serial clock pulses at the beginning of
                    each serial bit transfer</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAMPLELEADING</name>
                  <description>Serial clock pulses at the end of each
                    serial bit transfer</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MASEN</name>
              <description>Master mode enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Enable slave mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable master mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>SPI enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the SPI</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the SPI</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI0DMA</name>
          <description>SPI DMA enable register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>IENRXDMA</name>
              <description>Enable receive DMA request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable RX DMA Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable RX DMA Interrupt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IENTXDMA</name>
              <description>Enable transmit DMA request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TX DMA Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable TX DMA Interrupt</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable DMA for data transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x00000001</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SPI0CNT</name>
          <description>Transfer byte count register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>0x00000010</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>COUNT</name>
              <description>Transfer byte count</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0x00000000</minimum>
                  <maximum>0x000000FF</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
